driver-tests/httpsoapbc/siebel/siebelAccountDeleteCompositeApp/test/TestCase0/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echo"/>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>