driver-tests/httpsoapbc/siebel/siebelAccountInsertCompositeApp/test/TestCase0/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:echo="http://stc.com/echo">
  <soapenv:Body>
    <echo:item>
      <echo:value>?string?</echo:value>
    </echo:item>
  </soapenv:Body>
</soapenv:Envelope>