driver-tests/httpsoapbc/siebel/siebelContactQueryCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:echo="http://stc.com/echo">
  <soapenv:Body>
    <echo:item>
      <echo:value>0-1</echo:value>
    </echo:item>
  </soapenv:Body>
</soapenv:Envelope>